# Import Oil JSON

In [1]:
#json validator to confirm your file is really in json format, https://jsonlint.com/

import json
import pandas as pd



gold_json = './data/daily_gold.json'

with open(gold_json) as datafile:
    data = json.load(datafile)
gold_json_df = pd.DataFrame(data)
gold_json_df.head()

   close        date  name   ticker
0  226.0  12/29/1978  Gold  troy_oz
1  226.0    1/1/1979  Gold  troy_oz
2  226.8    1/2/1979  Gold  troy_oz
3  218.6    1/3/1979  Gold  troy_oz
4  223.2    1/4/1979  Gold  troy_oz

# Transfer to MySQL

In [3]:
# CONNECT TO MYSQL

#pip install mysql-connector-python
import pandas as pd
from sqlalchemy import create_engine
import mysql.connector
import datetime as dt

#database must already exist in a MySQL 
#connection_string = '<username>:<password>@localhost/<database name>'
connection_string = 'root:<password>@localhost/financials'

engine = create_engine(f'mysql+mysqlconnector://{connection_string}')

print(engine)

Engine(mysql+mysqlconnector://root:***@localhost/financials)

In [4]:
# CHECK FOR ALREADY EXISTING TABLES (OPTIONAL)
engine.table_names()

['crypto', 'gold']

In [5]:
# READ TABLE CONTENTS IF EXISTS (OPTIONAL)
conn = engine.connect()
gold_mysql_df = pd.read_sql("SELECT * FROM gold", conn)
gold_mysql_df.head()

Empty DataFrame
Columns: [name, ticker, date, close]
Index: []

In [6]:
# Convert Date string to date
gold_json_df['date'] = pd.to_datetime(gold_json_df['date'])
gold_json_df.head()

   close       date  name   ticker
0  226.0 1978-12-29  Gold  troy_oz
1  226.0 1979-01-01  Gold  troy_oz
2  226.8 1979-01-02  Gold  troy_oz
3  218.6 1979-01-03  Gold  troy_oz
4  223.2 1979-01-04  Gold  troy_oz

In [28]:
# ADD DATA TO TABLE
gold_json_df.to_sql(name='gold', con=engine, if_exists='append', index=False)
#gold_json_df.head()

In [21]:
import numpy as np

In [22]:

gold_json_df[gold_json_df['close']==''] = np.nan

gold_json_df.dropna(subset=['close'],inplace=True)

In [26]:
gold_json_df.head()

   close       date  name   ticker
0  226.0 1978-12-29  Gold  troy_oz
1  226.0 1979-01-01  Gold  troy_oz
2  226.8 1979-01-02  Gold  troy_oz
3  218.6 1979-01-03  Gold  troy_oz
4  223.2 1979-01-04  Gold  troy_oz

In [12]:
gold_json_df['close'] = gold_json_df['close'].str.replace(',', '')

In [ ]:
# CHECK FOR EXISTING TABLES (OPTIONAL)
engine.table_names()

In [32]:
excel_file = './data/oil.xlsx'
excel_df = pd.read_excel(excel_file) 
excel_df.head()

  name ticker       date  close
0  OIL    USO 1986-01-02  25.56
1  OIL    USO 1986-01-03  26.00
2  OIL    USO 1986-01-06  26.53
3  OIL    USO 1986-01-07  25.85
4  OIL    USO 1986-01-08  25.87

In [31]:
#engine.execute('CREATE TABLE OIL ('name' VARCHAR(10), 'ticker' VARCHAR(10), 'date' DATE, 'close' FLOAT)')

excel_df.to_sql(name='oils', con=engine, if_exists='append', index=False)

In [33]:
csv_file = "data/stock.csv"
stock_df = pd.read_csv(csv_file)
stock_df['date'] = pd.to_datetime(stock_df['date'])
stock_df.head()
#engine.execute('CREATE TABLE STOCKS ('name' VARCHAR(10), 'ticker' VARCHAR(10), 'date' DATE, 'close' FLOAT)')

  name ticker       date  close
0  AAL    AAL 2013-02-08  14.75
1  AAL    AAL 2013-02-11  14.46
2  AAL    AAL 2013-02-12  14.27
3  AAL    AAL 2013-02-13  14.66
4  AAL    AAL 2013-02-14  13.99

In [43]:
stock_df.to_sql(name='stocks', con=engine, if_exists='append', index=False)

In [35]:
stock_df.head()

  name ticker       date  close
0  AAL    AAL 2013-02-08  14.75
1  AAL    AAL 2013-02-11  14.46
2  AAL    AAL 2013-02-12  14.27
3  AAL    AAL 2013-02-13  14.66
4  AAL    AAL 2013-02-14  13.99